---
kind: type
id: T:Autodesk.Revit.DB.Events.CreateRelatedFileProgressChangedEventArgs
source: html/94a4184c-e0d2-a846-ba1d-52cea6b0a29f.htm
---
# Autodesk.Revit.DB.Events.CreateRelatedFileProgressChangedEventArgs

The event arguments used during creating related file phase of [!:Autodesk::Revit::ApplicationServices::Application::WorksharedOperationProgressChanged] in model open operation.

## Syntax (C#)
```csharp
public class CreateRelatedFileProgressChangedEventArgs : DataTransferProgressChangedEventArgs
```